In [14]:
import pandas as pd

### Un Dataframes es un conjunto de datos

In [30]:
tabla = pd.read_csv('/Users/miguelpantigoso/Downloads/datos.csv', sep=';', engine='python')
tabla

   N   Nombre  Edad Pais  Carro
0  1   Miguel    27  Peru    Si
1  2  Gabriel    25  Peru    No
2  3     Cris    20  Peru    No
3  4   Carlos    34  Peru    Si

### Una serie es una lista de datos unidimensional cada columna y fila vendria a ser serie

In [31]:
print(tabla.columns.tolist())

['N', 'Nombre', 'Edad', 'Pais ', 'Carro']

Accediendo a una serie(columna en este caso NOMBRE)

In [20]:
tabla['Nombre']

0     Miguel
1    Gabriel
2       Cris
3     Carlos
Name: Nombre, dtype: object

In [21]:
tabla.Edad

0    27
1    25
2    20
3    34
Name: Edad, dtype: int64

In [28]:
tabla.Carro

0    Si
1    No
2    No
3    Si
Name: Carro, dtype: object

In [29]:
tabla[['Nombre','Carro']]

    Nombre Carro
0   Miguel    Si
1  Gabriel    No
2     Cris    No
3   Carlos    Si

In [33]:
type(tabla.Nombre)

pandas.core.series.Series

In [34]:
type(tabla[['Nombre','Carro']])

pandas.core.frame.DataFrame